{
    "_name_or_path": "./yi-vl-34b",
    "architectures": [
        "LlavaLlamaForCausalLM"
    ],
    "attention_bias": false,
    "bos_token_id": 1,
    "eos_token_id": 2,
    "freeze_mm_mlp_adapter": false,
    "hidden_act": "silu",
    "hidden_size": 7168,
    "image_aspect_ratio": "pad",
    "image_grid_pinpoints": null,
    "initializer_range": 0.02,
    "intermediate_size": 20480,
    "max_position_embeddings": 4096,
    "mm_hidden_size": 1280,
    "mm_projector_type": "mlp2x_gelu_Norm",
    "mm_use_im_patch_token": false,
    "mm_use_im_start_end": false,
    "mm_vision_select_feature": "patch",
    "mm_vision_select_layer": -2,
    "mm_vision_tower": "/home/hongyixin/vqa_eval/models/YiVL/models/Yi-VL-34B/./vit/clip-vit-H-14-laion2B-s32B-b79K-yi-vl-34B-448",
    "model_type": "llava",
    "moe_layer": null,
    "moe_mode": "easy",
    "num_attention_heads": 56,
    "num_hidden_layers": 60,
    "num_key_value_heads": 8,
    "pretraining_tp": 1,
    "rms_norm_eps": 1e-05,
    "rope_scaling": null,
    "rope_theta": 5000000.0,
    "tie_word_embeddings": false,
    "torch_dtype": "bfloat16",
    "transformers_version": "4.34.0",
    "tune_mm_mlp_adapter": false,
    "tune_vision_tower": true,
    "use_cache": false,
    "use_mm_proj": true,
    "vocab_size": 64000
}